Revit 2026 API

# ExportLayerInfoRemoveCutLayerModifier Method

---

Removes a cut layer modifier from the layer info.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveCutLayerModifier(
	LayerModifier layerModifier
)
```
```vb
Public Sub RemoveCutLayerModifier (
	layerModifier As LayerModifier
)
```
```cpp
public:
void RemoveCutLayerModifier(
	LayerModifier^ layerModifier
)
```
```fsharp
member RemoveCutLayerModifier :
        layerModifier : LayerModifier -> unit
```

#### Parameters

layerModifier LayerModifier
     The cut layer modifier.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLayerInfo Class

Autodesk.Revit.DB Namespace